## [20210317NOTES]

#### NumPy
NumPy is a Linear Algebra Library for Python. 使用python進行線性代數運算的模組

#### Create an array
numpy.array(object, dtype=None, copy=True, order='K', subok=False, ndmin=0)


* np.arange
* np.zeros
* np.ones
* np.eye
* np.linspace
* np.rand 
* np.randn
* np.randint
* np.ndim <br/>
  陣列的維度
* np.shape <br/> 
     陣列各維度的個數
* np.dtype <br/> 
     陣列裡的元素型別
* np.type <br/>
     資料類型
* np.astrpy <br/>
     由字元或字串轉為數值

#### import as a library
import numpy as np

* 一維陣列
A = np.array([1,2,3])

* 二維陣列 row=橫的，colume =直的
np.array([[1,2,3],[4,5,6],[7,8,9]])

* 矩陣計算  <br/>
A+A  <br/>
A*5  <br/> 
A*A (平方) 

B = np.array([[1],[2],[3]])  <br/>
同個Column有3個row 

     
- np.arrange(start, end, step) <br/> 
start及step可省略
- np.arange(0,11,2) <br/> 
0~10 2個間隔
- np.zeros(3) <br/> 
row裡面的3個0 
- np.ones((4,5)) <br/>
row 要 4 個1， C 5個1， +逗號區分r跟c 
- np.eye(4) 
- 數值平均分布的陣列 <br/>
np.linspace(0, 5, 10)


- ranarr = np.random.randint(0,50,10)   <br/>
取十個 
- ranarr.max()
- ranarr.min()
- ranarr.argmax() <br/>
找出最大值位置 
- ranarr.argmin() <br/>
找出最小值位置 
- ranarr.sum()
- ranarr.mean()
- ranarr.std()
- np.sqrt(ranarr)
- np.exp(ranarr)
- np.power(ranarr)

* Series 一維陣列資料結構  <br/>
Series裡有兩個重要的屬性：索引鍵（index）和對應的值（values）。透過這兩個屬性可以取到Series裡的資料。 <br/>
pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan']) 

- ser[ser > 3] <br/>
  只要序列>3的值 
- ser.isnull() <br/>
 是否為空值，回傳布林值
 
 
- df.head()  <br/> 
叫出前5個 
- df.describe() <br/>
summary stastics count=>幾個變數 
- df.sort_values(by='X')  <br/>
用X排從小到大 ，調整INDEX位置  
-  create a new column <br/>
 df['new'] = df['W'] + df['Y'] <br/>
[]=>表一個COL

- drop column(axis=1) <br/>
df.drop('new',axis=1)

- same as del df['new'] #永久取代NEW COL  永久置換<br/>
df.drop('new',axis=1, inplace = True ) <br/>
inplace = False by default 

- df.rename(index={'A':'CA', 'B':'NY', 'C':'WY', 'D':'OR', 'E':'CO'}, inplace=True) 

#### Selection 
列索引鍵取值, loc是location的縮寫, iloc是index location的縮寫

df.loc[row, col] <br/>
df.iloc[row, col] <br/>
df[col] <br/>
df[a:b] 使用row編號選取row <br/>
df[col][row] <br/> 

#### Missing data 遺失值
NaN（Not a number）在Python是一個特殊的值，只能用函數來檢查，不能用等號檢查，即使用np.NaN == np.NaN都是False

- check for null value   <br/>
df.isnull() <br/>

- df.isnull().sum()

- df.isnull().sum().sum()  <br/>
幾個NAN 

#### Handle missing value  <br/>
#一般遺失值在20%以下，會DROP掉，或取代，或填平均值  <br/>
 ignore <br/>
 drop <br/>
 fill in <br/>

- Drop rows with NaN Values <br/>
df.dropna() <br/> 
- df.fillna(value = 'replace') <br/>  
- df['V'].fillna(value = df['V'].mean()) <br/> 

#### 簡單統計函數 <br/>
df.max() 最大值 <br/>
df.min() 最小值 <br/>
df.sum() 總和 <br/>
df.mean() 平均 <br/>
df.median() 中位數 <br/>
df.std() 標準差  <br/>

### [20210317HW]

1. 利用下面的資料建立DataFrame <br/>
list1 = [[90, 60, 33], [50, 70, 75], [70, 90, 88], [80, 50, 60]] <br/>
columns = ['Math', 'English', 'History'] <br/>
index=['Simon','Allen','Jimmy','Peter']

In [151]:
import pandas as pd
df = pd.DataFrame([[90, 60, 33], [50, 70, 75], [70, 90, 88], [80, 50, 60]],
                  index=['Simon','Allen','Jimmy','Peter'],
                  columns=['Math', 'English', 'History'])
df

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60


2. 取出數學>60 且英文>85 的資料, 並以DataFrame的方式呈現

In [86]:
df[df['Math'] > 60] 
df[df['English'] > 85]

       Math  English  History
Jimmy    70       90       88

In [158]:
df[ (df['Math'] > 60) & (df['English'] > 85) ]

       Math  English  History
Jimmy    70       90       88

3. 計算各科的平均數

In [87]:
df = pd.DataFrame([df['Math'].mean(),df['English'].mean(),df['History'].mean()],
                  index = ['Math', 'English','History'],
                  columns=['mean'])
df

         mean
Math     72.5
English  67.5
History  64.0

4. 依各科分數來個別排名

In [125]:
df['Math'].rank(ascending=False)

Simon    1.0
Allen    4.0
Jimmy    3.0
Peter    2.0
Name: Math, dtype: float64

In [126]:
df['English'].rank(ascending=False)

Simon    3.0
Allen    2.0
Jimmy    1.0
Peter    4.0
Name: English, dtype: float64

In [129]:
df['History'].rank(ascending=False)

Simon    4.0
Allen    2.0
Jimmy    1.0
Peter    3.0
Name: History, dtype: float64

In [128]:
df.sort_values(by='Math')

       Math  English  History Gender
Allen    50       70       75      F
Jimmy    70       90       88      M
Peter    80       50       60      M
Simon    90       60       33      M

In [98]:
df.sort_values(by='English')

       Math  English  History
Peter    80       50       60
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88

In [100]:
df.sort_values(by='History')

       Math  English  History
Simon    90       60       33
Peter    80       50       60
Allen    50       70       75
Jimmy    70       90       88

5. 新增性別資料
Gender = ['M'.'F','M','M']

In [147]:
df['Gender']=['M','F','M','M']
df

       Math  English  History Gender
Simon    90       60       33      M
Allen    50       70       75      F
Jimmy    70       90       88      M
Peter    80       50       60      M

6. 性別的類別各出現幾次？

In [148]:
df['Gender'].value_counts()

M    3
F    1
Name: Gender, dtype: int64

7. 算出每位同學的平均分數，再用平均分數排名

In [124]:
means=df.mean(axis=1)
print(means)
means.rank(ascending=False)

Simon    61.000000
Allen    65.000000
Jimmy    82.666667
Peter    63.333333
dtype: float64

Simon    4.0
Allen    2.0
Jimmy    1.0
Peter    3.0
dtype: float64